In [1]:
### Pandas Features ###
########################
# 1. String Functions - 
# 2. Merging/Joining - merge, join, concat
# 3. Missing Data
# 4. Statisticial
# 5. Data Iteration
# 6. Data Grouping
# 7. Aggregation
# 8. Sorting
# 9. Function Application
### Logical Indexing

In [2]:
import pandas as pd

In [3]:
df = pd.read_csv('alcohol_consumption.csv')
df.head()

,Entity,Code,Year,"Total alcohol consumption per capita (liters of pure alcohol, projected estimates, 15+ years of age)",Population (historical estimates)
0,Abkhazia,OWID_ABK,2015,NaN,NaN
1,Afghanistan,AFG,2010,0.21,29185511.0
2,Afghanistan,AFG,2015,0.21,34413603.0
3,Afghanistan,AFG,2018,0.21,37171922.0
4,Afghanistan,AFG,2002,NaN,22600774.0

In [7]:
# String Functions
### Works on Series
### series.str.function()

df['Entity'].str.count('a')
df['Entity'].str.contains('a')
df['Entity'].str.find('a')
df['Entity'].str.get_dummies()
df['Entity'].str.get(-1)
df['Entity'].str.join('+')
df['Entity'].str.lower()
df['Entity'].str.lower().str.count('a')
df['Entity'].str.repeat(2)
#  df['Entity'].str.repeat([3,3,2,4,2,4,2,2,3,1,3,3,2,4,2,4,2,2,3,1,3,3,2,4,2,4,2,2,3,1,3,3,2,4,2,4,2,2,3])
df['Entity'].str.replace('A','K', case=False)
df['Entity'].str.upper()
df['Entity'].str.split().str.get(0)
df['Entity'].str.len()

0         8
1        11
2        11
3        11
4        11
         ..
57079     8
57080     8
57081     8
57082     8
57083    13
Name: Entity, Length: 57084, dtype: int64

In [8]:
df1 = pd.DataFrame({'name':['John','Victor','Michael','Viriginia','Mike'], 'id':[3,4,1,2,5]})
df1

        name  id
0       John   3
1     Victor   4
2    Michael   1
3  Viriginia   2
4       Mike   5

In [9]:
df2 = pd.DataFrame({'domain':['IT','Sales','Sales','HomeMaker','Manager'], 'id':[1,2,3,9,6]})
df2

      domain  id
0         IT   1
1      Sales   2
2      Sales   3
3  HomeMaker   9
4    Manager   6

In [10]:
df3 = pd.DataFrame({'city':['NY','London','Dublin','Torronto','Texas'], 'id':[3,2,1,9,5]})
df3

       city  id
0        NY   3
1    London   2
2    Dublin   1
3  Torronto   9
4     Texas   5

In [11]:
pd.merge(df1, df2, on='id')

        name  id domain
0       John   3  Sales
1    Michael   1     IT
2  Viriginia   2  Sales

In [12]:
pd.merge(df1, df2, on='id', how='outer')

        name  id     domain
0       John   3      Sales
1     Victor   4        NaN
2    Michael   1         IT
3  Viriginia   2      Sales
4       Mike   5        NaN
5        NaN   9  HomeMaker
6        NaN   6    Manager

In [13]:
pd.merge(df1, df2, on='id', how='left')

        name  id domain
0       John   3  Sales
1     Victor   4    NaN
2    Michael   1     IT
3  Viriginia   2  Sales
4       Mike   5    NaN

In [14]:
pd.concat([df1,df3],axis=1)

        name  id      city  id
0       John   3        NY   3
1     Victor   4    London   2
2    Michael   1    Dublin   1
3  Viriginia   2  Torronto   9
4       Mike   5     Texas   5

In [15]:
pd.concat([df1,df3])

        name  id      city
0       John   3       NaN
1     Victor   4       NaN
2    Michael   1       NaN
3  Viriginia   2       NaN
4       Mike   5       NaN
0        NaN   3        NY
1        NaN   2    London
2        NaN   1    Dublin
3        NaN   9  Torronto
4        NaN   5     Texas

In [16]:
df1, df3

(        name  id
 0       John   3
 1     Victor   4
 2    Michael   1
 3  Viriginia   2
 4       Mike   5,
        city  id
 0        NY   3
 1    London   2
 2    Dublin   1
 3  Torronto   9
 4     Texas   5)

In [17]:
df4 = df1.join(df3, rsuffix='_right',how='inner')   #,on='id')
df4

        name  id      city  id_right
0       John   3        NY         3
1     Victor   4    London         2
2    Michael   1    Dublin         1
3  Viriginia   2  Torronto         9
4       Mike   5     Texas         5

In [18]:
## Logical Indexing

In [19]:
df4['city'].str.len() > 5

0    False
1     True
2     True
3     True
4    False
Name: city, dtype: bool

In [20]:
df4[df4['city'].str.len() > 5]

        name  id      city  id_right
1     Victor   4    London         2
2    Michael   1    Dublin         1
3  Viriginia   2  Torronto         9

In [21]:
(df4['city'].str.len() > 5) & (df4['name'].str.len() < 7)& (df4['name'].str.len() > 3)

0    False
1     True
2    False
3    False
4    False
dtype: bool

In [22]:
df4[(df4['city'].str.len() > 5) & (df4['name'].str.len() < 7)& (df4['name'].str.len() > 3)]

     name  id    city  id_right
1  Victor   4  London         2

In [23]:
# Missing Data

In [24]:
df12 = pd.merge(df1, df2, on='id', how='outer')
df123 = pd.merge(df12, df3, on='id', how='outer')
df123

        name  id     domain      city
0       John   3      Sales        NY
1     Victor   4        NaN       NaN
2    Michael   1         IT    Dublin
3  Viriginia   2      Sales    London
4       Mike   5        NaN     Texas
5        NaN   9  HomeMaker  Torronto
6        NaN   6    Manager       NaN

In [25]:
df123.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   id      7 non-null      int64
 2   domain  5 non-null      object
 3   city    5 non-null      object
dtypes: int64(1), object(3)
memory usage: 352.0+ bytes

In [26]:
pd.isnull(df123)

    name     id  domain   city
0  False  False   False  False
1  False  False    True   True
2  False  False   False  False
3  False  False   False  False
4  False  False    True  False
5   True  False   False  False
6   True  False   False   True

In [27]:
pd.isnull(df123).sum()

name      2
id        0
domain    2
city      2
dtype: int64

In [28]:
100 * pd.isnull(df123).sum()/len(df123)

name      28.571429
id         0.000000
domain    28.571429
city      28.571429
dtype: float64

In [29]:
df123.isna()

    name     id  domain   city
0  False  False   False  False
1  False  False    True   True
2  False  False   False  False
3  False  False   False  False
4  False  False    True  False
5   True  False   False  False
6   True  False   False   True

In [30]:
df123.fillna('NoValue')

        name  id     domain      city
0       John   3      Sales        NY
1     Victor   4    NoValue   NoValue
2    Michael   1         IT    Dublin
3  Viriginia   2      Sales    London
4       Mike   5    NoValue     Texas
5    NoValue   9  HomeMaker  Torronto
6    NoValue   6    Manager   NoValue

In [31]:
df123.fillna('NoValue').info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    7 non-null      object
 1   id      7 non-null      int64
 2   domain  7 non-null      object
 3   city    7 non-null      object
dtypes: int64(1), object(3)
memory usage: 352.0+ bytes

In [32]:
import numpy as np

In [33]:
d = pd.DataFrame({'a':[4,6,2,5,25,6], 'b':[5,3,np.nan,np.nan,10,23]})
d

    a     b
0   4   5.0
1   6   3.0
2   2   NaN
3   5   NaN
4  25  10.0
5   6  23.0

In [34]:
dd = d.fillna(d['b'].mean())
dd

    a      b
0   4   5.00
1   6   3.00
2   2  10.25
3   5  10.25
4  25  10.00
5   6  23.00

In [35]:
# Missing Data Problem?
#### Methods to cure
####### 1. Drop the columns (>20% missing)
####### 2. Drop the rows    (>20% missing)
####### 3. Fill with dummy data

In [36]:
# Statistical Functions
dd.mean()
dd.sum()
dd.count()
dd.std()
dd.var()
dd.corr()
dd.median()
dd.quantile(0.25)
dd.quantile(0.75)
dd.min()
dd.max()
dd.round(1)
dd.prod()

a     36000.000
b    362465.625
dtype: float64

In [37]:
## Data Iteration

# oridinary way
for i in df123:
    print(i)

name
id
domain
city

In [38]:
df123

        name  id     domain      city
0       John   3      Sales        NY
1     Victor   4        NaN       NaN
2    Michael   1         IT    Dublin
3  Viriginia   2      Sales    London
4       Mike   5        NaN     Texas
5        NaN   9  HomeMaker  Torronto
6        NaN   6    Manager       NaN

In [39]:
for ind, val in df123.iterrows():  # generator
    print(ind)
    print(val)
    print('')

0
name       John
id            3
domain    Sales
city         NY
Name: 0, dtype: object

1
name      Victor
id             4
domain       NaN
city         NaN
Name: 1, dtype: object

2
name      Michael
id              1
domain         IT
city       Dublin
Name: 2, dtype: object

3
name      Viriginia
id                2
domain        Sales
city         London
Name: 3, dtype: object

4
name       Mike
id            5
domain      NaN
city      Texas
Name: 4, dtype: object

5
name            NaN
id                9
domain    HomeMaker
city       Torronto
Name: 5, dtype: object

6
name          NaN
id              6
domain    Manager
city          NaN
Name: 6, dtype: object

In [40]:
for i in df123.itertuples():
    print(i)

Pandas(Index=0, name='John', id=3, domain='Sales', city='NY')
Pandas(Index=1, name='Victor', id=4, domain=nan, city=nan)
Pandas(Index=2, name='Michael', id=1, domain='IT', city='Dublin')
Pandas(Index=3, name='Viriginia', id=2, domain='Sales', city='London')
Pandas(Index=4, name='Mike', id=5, domain=nan, city='Texas')
Pandas(Index=5, name=nan, id=9, domain='HomeMaker', city='Torronto')
Pandas(Index=6, name=nan, id=6, domain='Manager', city=nan)

In [41]:

i.domain

'Manager'

In [42]:
i[3]

'Manager'